import React, {Component} from 'react';
import {Switch, Route} from 'react-router-dom';

import WordDivider from './Components/WordDivider/WordDivider';
import Message from './Components/Message/Message';
import Jumpotron from './Components/Jumpotron/Jumpotron';
import Result from './Components/Result/Result';
import Rules from './Components/Rules/Rules';

import './App.css';

class App extends Component {

  state = {
    1: {
      text: 'درجات  الحرارة المرتفعة  تقتل  فايروس كورونا',
      truth: 'انتشر الفايروس في المناطق الحارة و مناطق ذات مناخ رطب و البارد اي انه يمكن انتشاره في كافة الظروف الجوية',
      status: "خرافة"
    },
    2: {
      text: 'ينتقل الفيروس  عن طريق  ملامسة العين  والانف والفم',
      truth: 'نعم ينتقل الفايروس عن طريق المصافحة و ملامسة العينين و الانف و الفم',
      status: "حقيقة"
    },
    3: {
      text: 'مرضى القلب  والمدخنين  اكثر  عرضة  للاصابة  بفيروس كورونا',
      truth: 'الاشخاص الذين يعانون من حالات مرضية كامنة من الممكن أن تتفاقم مثل أمراض القلب هم أكثر عرضة للاصابة بالكورونا',
      status: "خرافة"
    },
    4: {
      text: 'المضادات الحيوية  فعالة  في  الوقاية  من الفيروس',
      truth: ' لا ، لا تقضي المضادات الحيوية على الفايروسات بل تقضي على الجراثيم فقط وفايروس الكورونا يعد من الفايروسات',
      status: "خرافة"
    },
    5: {
      text: 'الاصابة  بالفيروس  تؤدي  الى  الموت',
      truth: 'لا تؤدي الى الموت نسبة الوفيات بسبب فايروس كورونا 2% من اجمالي الاصابات ',
      status: "خرافة"
    },
    6: {
      text: 'الثوم  طعام صحي  ليس  له علاقة بفيروس كورونا',
      truth: 'الثوم طعام صحي وله خواص ضد البكتيريا لكن ليس له علاقة بفيروس كورونا',
      status: "حقيقة"
    },
    7: {
      text: 'استلام  الطرود  من الصين  قد  يصيبك  بالعدوى',
      truth: 'لا خطر  من الاشياء القادمة من الصين الفيروس  ليس له فاعلية طويلة',
      status: "خرافة"
    },
    8: {
      text: 'اغسل  نفسك  بالمطهرات  الكيميائية  لمنع  التعرض  للعدوى',
      truth: 'لا ، التعرض المباشر للمواد الكيميائية  أمر خطير يمكن  أن يكون،  قاتلا',
      status: "خرافة"
    },
    9: {
      text: 'الحيوانات الاليفة  يمكن  ان  تنقل  العدوى',
      truth: 'يوجد دراسة علمية تشير الى هذا الكلام لكن يفضل غسل الايدي عقب الامساك بالحيوانات الاليفة',
      status: "خرافة"
    },
    10: {
      text: 'لقاحات الالتهاب  الرئوي  تحمي  من  الاصابة  بكورونا',
      truth: 'لن تحمي هذه اللقاحات من فيروس كورونا الجديد بل لا يزال العلماء يسعون لتطوير لقاح جديد ضده',
      status: "خرافة"
    },
    11: {
      text: 'غسول  الفم  يحمي  من  الاصابة  بالفيروس',
      truth: 'الغسول يقتل ميكروبات معينة في الفم وليس له علاقة بكورونا',
      status: 'خرافة'
    },
    12: {
      text: 'من الجيد  وضع  كمامة  منزلية  الصنع  للوقاية',
      truth: 'معلومة غير صحيحة حيث انها غير مناسبة و تسبب صعوبة في التنفس ولا تعمل على الوقاية من الفايروس ',
      status: "خرافة"
    },
    13: {
      text: 'الحمى  من  اعراض  الاصابة  بالفيروس',
      truth: 'نعم ، ارتفاع درجة الحرارة عن المعدل الطبيعي أي الحمى نتيجة الاصابة بالمرض و يستخدم ميزان الحرارة كمؤشر لكشف الاعراض',
      status: "حقيقة"
    },
    14: {
      text: 'ارتداء  قفازات  في  الاماكن العامة  يحمي  من الاصابة',
      truth: 'لا ، المواظبة على غسل اليدين يوفر حماية اكثر من القفازات المطاطية التي قد تتلوث واذا لامست وجهك خلال ارتداها ستنقل المرض',
      status: "خرافة"
    },
    15: {
      text: 'غسل الانف  بالماء المالح  يمنع  الاصابة  بالفيروس',
      truth: 'منظمة الصحة العالمية تؤكد انه لايوجد اي دليل على ان محلول الملح يقتل فيروس كورونا الجديد',
      status: "خرافة"
    },
  }

  render() {

    let sentence = Math.floor((Math.random() * 14) + 1); 
    
    return (
      <div>
        <Switch>
          <Route 
            path="/start" 
            render={() => <WordDivider 
                            sentence = {this.state[sentence].text} 
                            status = {this.state[sentence].status} 
                            truth = {this.state[sentence].truth}
                          />} 
          />
          <Route path="/result" component={Result} />
          <Route path="/message" component={Message} />
          <Route path="/rules" component={Rules} />
          <Route path="/" exact component={Jumpotron} />
        </Switch>
      </div>
    );
  }
}

export default App;
